
Pandas library has a ability to read data and write data to a wide variety of sources, like CSV,Excel, SQL, HTML from web.
Inorder to work with HTML and SQL we need 4 libraries :
conda install sqlalchemy
conda install lxml
conda install html5lib
conda install BeautifulSoup4

In [50]:
pwd #on this exact location we wnat to place CSV,Excel, SQL, HTML for acess.

'C:\\Users\\ASUS\\OneDrive\\Desktop\\Py-DS-ML-Bootcamp-master-main\\Refactored_Py_DS_ML_Bootcamp-master\\03-Python-for-Data-Analysis-Pandas'

In [51]:
import pandas as pd
import numpy as np

In [52]:
df = pd.read_csv('example') #we have lot of 'read' option by (shift+tab) we can see them.

In [53]:
df.to_csv('my_output') #we have lot of 'to' option by (shift+tab) we can see them.

In [54]:
pd.read_csv('my_output') # here we have a unnamed column.which is index for previous example csv file.to remove that.

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [55]:
df.to_csv('my_output_1',index=False)# now we get properly.

In [56]:
pd.read_csv('my_output_1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

Each sheet in excel is a dataframe.

In [57]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='New_Sheet') #we want to pass excel file name with which sheet.

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [58]:
df.to_excel('Excel_Sample1.xlsx',sheet_name='New_Sheet',index=False)

In [59]:
pd.read_excel('Excel_Sample1.xlsx',sheet_name='New_Sheet')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [60]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html') #return as list.this is essential for web scraping.

In [61]:
data[0].head()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545

In [62]:
from sqlalchemy import create_engine

In [63]:
engine = create_engine('sqlite:///:memory:')

In [64]:
df.to_sql('data', engine)

4

In [65]:
sql_df = pd.read_sql('data',con=engine)

In [66]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15